In [1]:
import numpy as np
import pandas as pd

# Creating a Series
You can convert a list,numpy array, or dictionary to a series

In [2]:
label=['a','b','c']
my_list=[10,20,30]
arr=np.array([10,20,30])
d={'a':10,'b':20,'c':30}

In [3]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [5]:
pd.Series(data=my_list,index=label)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(my_list,label)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(label,my_list)

10    a
20    b
30    c
dtype: object

In [8]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

# Data in a Series
A pandas series can hold a variety of object types.

In [9]:
pd.Series(data=label)

0    a
1    b
2    c
dtype: object

In [10]:
#even functions (although unlikely that you will use this)
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

# Using an index

In [13]:
ser1=pd.Series([1,2,3,4],index=['USA','Germany','USSR','Japan'])

In [14]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [15]:
ser2=pd.Series([1,2,5,4],index=['USA','Germany','Italy','Japan'])

In [16]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [17]:
ser1['USA']

1

In [18]:
ser1+ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [23]:
from numpy.random import randn
np.random.seed(101)

In [44]:
ds=pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns=' W X Y Z'.split())

In [45]:
ds

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [46]:
ds['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [47]:
ds[['W','Z']]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [48]:
ds.W

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [49]:
ds['new']=ds['W']+ds['Y']

In [50]:
ds

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [51]:
ds.drop('new',axis=1)#axis=1 indicates your droppind column,axis=0 indicates your dropping row

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [52]:
ds

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [53]:
ds.drop('new',axis=1,inplace=True)

In [54]:
ds

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [55]:
ds.loc[['A','B'],['Y','Z']]

          Y         Z
A -1.706086 -1.159119
B  0.166905  0.184502

In [56]:
ds.iloc[:3,2:]

          Y         Z
A -1.706086 -1.159119
B  0.166905  0.184502
C  0.638787  0.329646

In [57]:
ds>0

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [59]:
ds[ds>0]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [61]:
ds[ds['W']>0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [62]:
ds[ds['W']>0]['Y']

A   -1.706086
C    0.638787
Name: Y, dtype: float64

In [63]:
ds[ds['W']>0][['Y','X']]

          Y         X
A -1.706086  1.693723
C  0.638787  0.072960

In [70]:
data={'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
     'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
     'Sales':[200,120,340,124,243,350]}

In [71]:
df=pd.DataFrame(data)

In [72]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [80]:
dk=df.groupby('Sales')

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001E95ACC0948>

In [82]:
df.to_csv('example',index=False)

In [86]:
df=pd.read_csv('example')#here example is the name of the file
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350